tt=0:34;
%吃饭时间的正态分布
D_eat=exp(-(tt-3).^2/(2*(2/1.96)^2))./(sqrt(2*pi)*2/1.96);
%plot(tt,D)
v_31=ones(1,34);%在食堂就餐完毕离开的人数
v_3=ones(1,34);%离开食堂的人数
v_21=ones(1,34);%排完队在食堂就餐的人数
n_2=ones(1,34);%滞留在食堂就餐的人数
for t=1:34;  
   v_31(t)=0;
    for i=1:t;
        alpha=t-i;
        v_31(t)=exp(-(i-3).^2/(2*(2/1.96)^2))./(sqrt(2*pi)*2/1.96)*((alpha<14.953504||alpha>26)*767*exp(-(alpha-18.4967)^2/(2*43.9892))/sqrt(2*pi*43.9892)+(alpha>=14.953504&alpha<=26)*40)*0.9+v_31(t);
    end
    v_3(t)=v_31(t)+((t<14.953504||t>26)*767*exp(-(t-18.4967)^2/(2*43.9892))/sqrt(2*pi*43.9892)+(t>=14.953504&t<=26)*40)*0.1;
    v_21(t)=((t<14.953504||t>26)*767*exp(-(t-18.4967)^2/(2*43.9892))/sqrt(2*pi*43.9892)+(t>=14.953504&t<=26)*40)*0.9;
end
t=1:34;
%画出在食堂就餐完毕离开的人数图像
plot(t,v_31)
hold on
%画出离开食堂的人数图像
plot(t,v_3,'r');
%画出排完队在食堂就餐的人数图像
plot(t,v_21);
%画出滞留食堂吃饭人数图像
for i=1:34;
    n_2(i)=sum(v_21(1,1:i)-v_31(1,1:i));
end
plot(t,n_2,'b');
title('N＝4');xlabel('时间／5min');ylabel('人数／个')
axis square